#include<bits/stdc++.h>

#define endl "\n"
using namespace std;
using ll = long long;
using ld = long double;
using pii = pair<int, int>;

constexpr int N = 1e5 + 5;
constexpr ll mod = 1e9 + 7;

/*

Сканирующая прямая

отрезки наи прямой, нужно отвечать, сколько отрезков покрывают данную точку

двумерная сканирующая прямая
есть множество прямоугольников
найти объединение

разобьем на вертикальные полоски
идем по полоскам(начало или конец очередного прямоугольника)
поддерживаем множество высот(начало и конец прямоугольника) и добавляем к ответу объединение(с помощью канлайна находим его) * ширину полоски


я люблю члены
все кто любитит члены пидорас
священник был прав 

на лекции сидели юнцы
тема была про площади
не Ильича...

границы ключ переломлен пополам
а наш батюшка Ленин
и это не про площадь его...

*/

void Solve(){
 
}

int main(){
  ios::sync_with_stdio(false);
  cin.tie(nullptr);
  cout.tie(nullptr);
  Solve();
  return 0;
}